export const GROUP_COLORS = [
  '#1890ff', // 蓝色
  '#52c41a', // 绿色
  '#faad14', // 橙色
  '#f5222d', // 红色
  '#722ed1', // 紫色
  '#13c2c2', // 青色
  '#eb2f96', // 粉色
  '#fa8c16', // 深橙色
  '#2f54eb', // 深蓝色
  '#fa541c', // 红橙色
  '#a0d911', // 青柠色
  '#531dab', // 深紫色
  '#08979c', // 深青色
  '#c41d7f', // 深粉色
  '#d4380d', // 深红橙色
  '#389e0d', // 深绿色
  '#096dd9', // 天蓝色
  '#d46b08', // 深橙色
  '#7cb305', // 青绿色
  '#642ab5', // 紫罗兰色
  '#006d75', // 墨绿色
  '#ad4e00', // 棕色
  '#1d39c4', // 靛蓝色
  '#d32029', // 深红色
] as const;

export const GROUP_COLOR_LABELS = [
  '蓝色',
  '绿色',
  '橙色',
  '红色',
  '紫色',
  '青色',
  '粉色',
  '深橙色',
  '深蓝色',
  '红橙色',
  '青柠色',
  '深紫色',
  '深青色',
  '深粉色',
  '深红橙色',
  '深绿色',
  '天蓝色',
  '深橙色',
  '青绿色',
  '紫罗兰色',
  '墨绿色',
  '棕色',
  '靛蓝色',
  '深红色',
] as const;
